app/controllers/app_controller.rb

SELECT "posts".* FROM "posts"
---
  def blog
    @posts = Post.all